---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
source: html/e6a90936-fb4f-9050-4d0e-eb40009abf91.htm
---
# VertexPositionColored Methods

Gets the vertex's color.